{"_id":{"$oid":"5fa5848507ec856a6f0e8847"},"Title":"Silence of the Lambs","Description":"'Clarice Starling, an FBI agent, seeks help from Hannibal Lecter, a psychopathic serial killer and former psychiatrist, in order to apprehend another serial killer who has been claiming female victims.","Genre":{"Name":"Thriller","Description":"Thriller is a genre of fiction, having numerous, often overlapping subgenres. Thrillers are characterized and defined by the moods they elicit, giving viewers heightened feelings of suspense, excitement, surprise, anticipation and anxiety."},"Director":"Jonathan Demme","ImagePath":"silenceofthelambs.png","Featured":false,"Bio":"Robert Jonathan Demme was an American film director, producer and screenwriter of film and television who earned widespread acclaim.","Birth":"1944-02-22"}
{"_id":{"$oid":"5fa589c107ec856a6f0e8848"},"Title":"Kill Bill Vol 1","Description":"A pregnant assassin, code-named The Bride, goes into a coma for four years after her ex-boss Bill brutally attacks her. When she wakes up, she sets out to seek revenge on him and his associates.","Genre":{"Name":"Action","Description":"Action film is a film genre in which the protagonist or protagonists are thrust into a series of events that typically include violence, extended fighting, physical feats, rescues and frantic chases."},"Director":"Quentin Tarantino","ImagePath":"killbill.png","Featured":false,"Bio":"Quentin Jerome Tarantino is an American film director, screenwriter, producer, and actor. His films are characterized by nonlinear storylines, aestheticization of violence, extended scenes of dialogue, ensemble casts, references to popular culture and a wide variety of other films, soundtracks primarily containing songs and score pieces from the 1960s to the 1980s, alternate history, and features of neo-noir film.","Birth":"1963-03-27"}
{"_id":{"$oid":"5fa58b2e07ec856a6f0e8849"},"Title":"Inception","Description":"Cobb steals information from his targets by entering their dreams. Saito offers to wipe clean Cobbs criminal history as payment for performing an inception on his sick competitors son.","Genre":{"Name":"Science Fiction","Description":"Science fiction is a genre of speculative fiction that typically deals with imaginative and futuristic concepts such as advanced science and technology, space exploration, time travel, parallel universes, and extraterrestrial life."},"Director":"Christopher Nolan","ImagePath":"inception.png","Featured":false,"Bio":"Christopher Nolan is a British American fil director, producer and screenwriter known for making personal, distinctive films within the Hollywood mainstream. His directorial efforts have grossed more than US$5 billion worldwide, garnered 34 Oscar nominations and ten wins.","Birth":"1970-07-30"}
{"_id":{"$oid":"5fa58e7d07ec856a6f0e884a"},"Title":"The Village","Description":"An isolated town lives in fear of an unknown monster from the surrounding woods. But when one from the community is badly injured, a blind girl sets out into the woods to find help from beyond.","Genre":{"Name":"Thriller","Description":"Thriller is a genre of fiction, having numerous, often overlapping subgenres. Thrillers are characterized and defined by the moods they elicit, giving viewers heightened feelings of suspense, excitement, surprise, anticipation and anxiety."},"Director":"M.Night Shyamalan","Bio":"Manoj Nelliyattu M. Night Shyamalan is an American filmmaker, philanthropist, and actor. He is known for making films with contemporary supernatural plots and twist endings. He was born in Mahé, Pondicherry, India, and raised in Penn Valley, Pennsylvania.","Birth":"1970-08-06","Featured":false,"ImagePath":"thevillage.png"}
{"_id":{"$oid":"5fa58f6907ec856a6f0e884b"},"Title":"Interstellar","Description":"In the future, where Earth is becoming uninhabitable, farmer and ex-NASA pilot Cooper is asked to pilot a spacecraft along with a team of researchers to find a new planet for humans.","Genre":{"Name":"Science Fiction","Description":"Science fiction is a genre of speculative fiction that typically deals with imaginative and futuristic concepts such as advanced science and technology, space exploration, time travel, parallel universes, and extraterrestrial life."},"Director":"Christopher Nolan","Featured":false,"Bio":"Christopher Nolan is a British American fil director, producer and screenwriter known for making personal, distinctive films within the Hollywood mainstream. His directorial efforts have grossed more than US$5 billion worldwide, garnered 34 Oscar nominations and ten wins.","Birth":"1970-07-30","ImagePath":"interstellar.png"}
{"_id":{"$oid":"5fa5902007ec856a6f0e884c"},"Title":"12 Monkeys","Description":"James Cole, a convict, decides to volunteer for a mission, wherein he has to travel back in time to learn about the main reason behind the outbreak of a virulent holocaust.","Genre":{"Name":"Science Fiction","Description":"Science fiction is a genre of speculative fiction that typically deals with imaginative and futuristic concepts such as advanced science and technology, space exploration, time travel, parallel universes, and extraterrestrial life."},"Director":"Terry Gilliam","Featured":false,"Bio":"Terrence Vance Gilliam is an American-born British film director, screenwriter, animator, actor, comedian and former member of the Monty Python comedy troupe.","Birth":"1940-11-22","ImagePath":"12monkeys.png"}
{"_id":{"$oid":"5fa590d507ec856a6f0e884d"},"Title":"Knives Out","Description":"The circumstances surrounding the death of crime novelist Harlan Thrombey are mysterious, but theres one thing that renowned Detective Benoit Blanc knows for sure -- everyone in the wildly dysfunctional Thrombey family is a suspect. Now, Blanc must sift through a web of lies and red herrings to uncover the truth.","Genre":{"Name":"Mystery","Description":"Mystery fiction is a genre of fiction that usually involves a mysterious death or a crime to be solved. Often within a closed circle of suspects, each suspect is usually provided with a credible motive and a reasonable opportunity for committing the crime."},"Director":"Rian Johnson","Featured":true,"Bio":"Rian Craig Johnson is an American film director, producer, and screenwriter. He is known for writing and directing the neo-noir film Brick, the comedy-drama The Brothers Bloom.","Birth":"1973-12-17","ImagePath":"knivesout.png"}
{"_id":{"$oid":"5fa5918007ec856a6f0e884e"},"Title":"Final Cut","Description":"Editor Alan finds footage of a man who he believes shares a connection with his past. On the other hand, former editor Fletcher wants the same footage and plans to steal it.","Genre":{"Name":"Science Fiction","Description":"Science fiction is a genre of speculative fiction that typically deals with imaginative and futuristic concepts such as advanced science and technology, space exploration, time travel, parallel universes, and extraterrestrial life."},"Director":"Omar Naim","Featured":false,"Bio":"Omar Naim is a Lebanese film director and screenwriter best known for writing and directing the 2004 film The Final Cut.","Birth":"1977-09-27","ImagePath":"finalcut.png"}
{"_id":{"$oid":"5fa5924607ec856a6f0e884f"},"Title":"The Virgin Suicides","Description":"In an ordinary suburban house, on a lovely tree-lined street, in the middle of 1970s America, lived the five beautiful, dreamy Lisbon sisters, whose doomed fates indelibly marked the neighborhood boys who to this day continue to obsess over them. A story of love and repression, fantasy and terror, sex and death, memory and longing. It is at its core a mystery story: a heart-rending investigation into the impenetrable, life-altering secrets of American adolescence.","Genre":{"Name":"Drama","Description":"In film and television, drama is a category of narrative fiction intended to be more serious than humorous in tone."},"Director":"Sofia Coppola","Featured":false,"Bio":"Sofia Carmina Coppola is an American screenwriter, director, producer, and actress. The daughter of filmmakers Eleanor and Francis Ford Coppola, she made her film debut as an infant in her fathers acclaimed crime drama film, The Godfather.","Birth":"1971-05-14","ImagePath":"thevirginsuicides.png"}
{"_id":{"$oid":"5fa592d407ec856a6f0e8850"},"Title":"Monster","Description":"Prostitute Aileen Wuornos meets Selby Wall and they begin a romance. When a john hurts Aileen she kills him. Supporting herself and Selby she tries to give up prostitution and resorts to crime to get by.","Genre":{"Name":"Mystery","Description":"Mystery fiction is a genre of fiction that usually involves a mysterious death or a crime to be solved. Often within a closed circle of suspects, each suspect is usually provided with a credible motive and a reasonable opportunity for committing the crime."},"Director":"Patty Jenkins","Featured":false,"Bio":"Patricia Lea Jenkins is an American director and screenwriter. She directed and wrote the films Monster, Wonder Woman, and the upcoming Wonder Woman 1984.","Birth":"1971-07-24","ImagePath":"monster.png"}
